// Белькевич Глеб
#include "Header.h"
#include <iostream>
#include <windows.h>
// Задачи в Златопольский: 12.268	12.286	13.26	13.44
using namespace std;
int main() {
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	// Задача 1
	/*
	Num1 A;
	A.NumA();
	A.NumB();
	*/
	// Задача 2
	/**/
	cout << "Введите информацию о двух фигурах в формате'1 12 3 16',\n где первое (1<=x<=4) и третье (1<=x<=5) число - код фигуры, первые цифры второго и четвёртого\nчислел (1<=x<=8) - вертикальная коорлината фигуры, вторые - горизонтальная\nTip:\n1 - Конь Knight\n2 - Слон Bishop\n3 - Ферзь Queen\n4 - Ладья Rook\n5 - Король King\n=-=-=-=-=-=-=-=-=\n";
	Num2 B;
	if (B.Secure()) {
		cout << "--------------------------------------\n";
		int *a, *b, *c;
		a = B.FillArray(B.getFig(), B.getCell());
		B.OutP(a);
		cout << "--------------------------------------\n";
		b = B.FillArray(B.getFig2(), B.getCell2());
		B.OutP(b);
		cout << "--------------------------------------\n";
		c = B.FinalCells(a, b);
		B.OutP(c);
	}
	else
		cout << "Данные введены неверно\n";
	/**/
	// Задача 3
	/*
	cout << "Введите информацию о машинах в формате *стоимость возраст* {enter} 20 раз\n\nInput:\n";
	int s = 0, k = 0;
	Num3 C[20];
	for (int i = 0; i <20; i++) {
		if (C[i].getage() > 6) {
			s += C[i].getcost();
			k++;
		}
	}
	cout << "Средняя стоимость автомобилей старше шести лет: " << s / k << endl;
	// Для тестов:
	/*
	1 1
	2 2
	3 3
	4 4
	5 5
	6 6
	7 7
	8 8
	9 9
	10 10
	11 11
	12 12
	13 13
	14 14
	15 15
	16 16
	17 17
	18 18
	19 19
	20 20
	*/
	// Задача 4
	/*
	cout << "Введите инфо о 15и учениках: фамилию *пробел* рост *enter*\n(данные о росте должны быть упорядочены по убыванию по усл.)\nЗатем так же введите информацию о новом ученике\n";
	Num4 D[16];
	int i = 14;
	cout << "\n\na)\n";
	for (; D[i].getsmtall() < D[15].getsmtall(); i--) {
		cout << D[i].getsurname() << endl;
	}
	cout << "\nб) Новенький должен следовать за " << D[i].getsurname() << "\n\nв) ";
	if ((D[i].getsmtall() - D[15].getsmtall()) < D[i + 1].getsmtall() - D[15].getsmtall())
		cout << "Минимальная разница с " << D[i].getsurname() << endl;
	else
		if ((D[i].getsmtall() - D[15].getsmtall()) > D[i + 1].getsmtall() - D[15].getsmtall())
			cout << "Минимальная разница с " << D[i + 1].getsurname() << endl;
		else
			cout << "С новым учеников разница одинаковая у " << D[i].getsurname() << " и " << D[i + 1].getsurname();
	/*
	Кузьменков 190
	Алексеев 185
	Бобоед 184
	Бобров 183
	Большакова 182
	Ботвинов 181
	Бразгун 180
	Галыня 179
	Григорович 176
	Литвинов 175
	Михайлов 174
	Мащёнский 173
	Паус 172
	Егоров 171
	Белькевич 168
	Хуан 177
	*/
	system("pause");
	return 0;
}